#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # hcloud_floating_ip.public_ip will be created
  + resource "hcloud_floating_ip" "public_ip" {
      + home_location = (known after apply)
      + id            = (known after apply)
      + ip_address    = (known after apply)
      + ip_network    = (known after apply)
      + name          = "dev-k8s-floating-ip"
      + server_id     = (known after apply)
      + type          = "ipv4"
    }

  # hcloud_floating_ip_assignment.master will be created
  + resource "hcloud_floating_ip_assignment" "master" {
      + floating_ip_id = (known after apply)
      + id             = (known after apply)
      + server_id      = (known after apply)
    }

  # hcloud_network.internalnet will be created
  + resource "hcloud_network" "internalnet" {
      + id       = (known after apply)
      + ip_range = "192.168.2.0/24"
      + name     = "dev-internalnet"
    }

  # hcloud_network_subnet.internalsubnet will be created
  + resource "hcloud_network_subnet" "internalsubnet" {
      + gateway      = (known after apply)
      + id           = (known after apply)
      + ip_range     = "192.168.2.0/28"
      + network_id   = (known after apply)
      + network_zone = "eu-central"
      + type         = "server"
    }

  # hcloud_server.master will be created
  + resource "hcloud_server" "master" {
      + backup_window = (known after apply)
      + backups       = false
      + datacenter    = (known after apply)
      + id            = (known after apply)
      + image         = "ubuntu-18.04"
      + ipv4_address  = (known after apply)
      + ipv6_address  = (known after apply)
      + ipv6_network  = (known after apply)
      + keep_disk     = false
      + location      = (known after apply)
      + name          = "dev-k8s-master"
      + server_type   = "cx21"
      + status        = (known after apply)
    }

  # hcloud_server_network.srvnetworkmaster will be created
  + resource "hcloud_server_network" "srvnetworkmaster" {
      + id          = (known after apply)
      + ip          = (known after apply)
      + mac_address = (known after apply)
      + network_id  = (known after apply)
      + server_id   = (known after apply)
    }

Plan: 6 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pusher: @witchpou, Action: `pull_request`*